{"meta":{"title":"Mr·Huang's Blog","subtitle":"it study","description":"记录个人计算机技术学习","author":"Mr·Huang","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"使用ejs模板主题添加在线联系功能","slug":"使用ejs模板主题添加在线功能","date":"2019-06-11T15:12:41.000Z","updated":"2019-06-11T15:57:22.135Z","comments":true,"path":"2019/06/11/使用ejs模板主题添加在线功能/","link":"","permalink":"http://yoursite.com/2019/06/11/使用ejs模板主题添加在线功能/","excerpt":"","text":"博客新增在线联系功能这个在线联系功能是用 DaoVoice 做的 第一步: 注册 DaoVoice 账号我的邀请码是 e01c7cad 完成后，会得到一个app_id，后面会用到 基于hexo搭建的博客,网上有很多教程,但都是swig模板的主题去添加的。因为我用的是ejs模板的主题，所以语法上是不一样的 第二步: 修改head.swig / head.ejs首先找到 /themes/next/layout/_partials/head.swig 这个文件，我的是 /themes/next/layout/_partials/head.ejs，在前面加上以下代码 注意’//widget.daovoice.io/widget/123456.js’ 中js文件名改成自己的id就行： 如果你的文件后缀是 .swjg 123456789&#123;% if theme.daovoice %&#125; &lt;script&gt; (function(i,s,o,g,r,a,m)&#123;i[&quot;DaoVoiceObject&quot;]=r;i[r]=i[r]||function()&#123;(i[r].q=i[r].q||[]).push(arguments)&#125;,i[r].l=1*new Date();a=s.createElement(o),m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;a.charset=&quot;utf-8&quot;;m.parentNode.insertBefore(a,m)&#125;)(window,document,&quot;script&quot;,(&apos;https:&apos; == document.location.protocol ? &apos;https:&apos; : &apos;http:&apos;) + &quot;//widget.daovoice.io/widget/123456.js&quot;,&quot;daovoice&quot;) daovoice(&apos;init&apos;, &#123; app_id: &quot;&#123;&#123;theme.daovoice_app_id&#125;&#125;&quot; &#125;); daovoice(&apos;update&apos;); &lt;/script&gt;&#123;% endif %&#125; 如果你的文件后缀是 .ejs 12345678910&#123;% if (theme.daovoice) %&#125; &lt;script&gt; (function(i,s,o,g,r,a,m)&#123;i[&quot;DaoVoiceObject&quot;]=r;i[r]=i[r]||function()&#123;(i[r].q=i[r].q||[]).push(arguments)&#125;,i[r].l=1*new Date();a=s.createElement(o),m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;a.charset=&quot;utf-8&quot;;m.parentNode.insertBefore(a,m)&#125;)(window,document,&quot;script&quot;,(&apos;https:&apos; == document.location.protocol ? &apos;https:&apos; : &apos;http:&apos;) + &quot;//widget.daovoice.io/widget/123456.js&quot;,&quot;daovoice&quot;) let app_id = &lt;%- JSON.stringify(theme.daovoice_app_id) %&gt; daovoice(&apos;init&apos;, &#123; app_id: app_id &#125;); daovoice(&apos;update&apos;); &lt;/script&gt;&#123;% &#125; %&#125; 第三步: 主题配置文件添加在_config.yml文件中添加内容： 123# Online contactdaovoice: truedaovoice_app_id: # 这里填你刚才获得的 app_id 至此，博客的在线联系功能已经完成。","categories":[{"name":"工具","slug":"工具","permalink":"http://yoursite.com/categories/工具/"}],"tags":[{"name":"即时通讯评论","slug":"即时通讯评论","permalink":"http://yoursite.com/tags/即时通讯评论/"}],"keywords":[{"name":"工具","slug":"工具","permalink":"http://yoursite.com/categories/工具/"}]},{"title":"《解忧杂货店》","slug":"《解忧杂货店》","date":"2019-06-10T13:12:24.000Z","updated":"2019-06-10T15:15:40.120Z","comments":true,"path":"2019/06/10/《解忧杂货店》/","link":"","permalink":"http://yoursite.com/2019/06/10/《解忧杂货店》/","excerpt":"","text":"内容简介该书讲述了在僻静街道旁的一家杂货店，只要写下烦恼投进店前门卷帘门的投信口，第二天就会在店后的牛奶箱里得到回答：因男友身患绝症，年轻女孩月兔在爱情与梦想间徘徊；松冈克郎为了音乐梦想离家漂泊，却在现实中寸步难行；少年浩介面临家庭巨变，挣扎在亲情与未来的迷茫中…… 他们将困惑写成信投进杂货店，奇妙的事情随即不断发生。 生命中的一次偶然交会,将如何演绎出截然不同的人生? 作者简介东野圭吾（ひがしの けいご，Higashino Keigo），日本推理小说作家。代表作有《放学后》、《秘密》、《白夜行》、《以眨眼干杯》、《神探伽利略》、《嫌疑人X的献身》、《预知梦》、《湖畔》等。1958年2月4日出生于日本大阪。毕业于大阪府立大学电气工学专业，之后在汽车零件供应商日本电装担任生产技术工程师，并进行推理小说的创作。1985年，凭借《放学后》获得第31回江户川乱步奖，从此成为职业作家，开始专职写作。1999年《秘密》获第52届日本推理作家协会奖，2006年《嫌疑人X的献身》获134届直木奖，东野圭吾从而达成了日本推理小说史上罕见的“三冠王”。2017年4月，第11届中国作家富豪榜子榜单“外国作家富豪榜”发布，东野圭吾问鼎外国作家富豪榜首位。同年出版小说集《第十年的情人节》。 经典语句心，一旦离开了，就再不会回来。 其实所有纠结做选择的人心里早就有了答案，咨询只是想得到内心所倾诉的选择。最终的所谓命运，还是自己一步一步走出来的。 人与人之间的情断义绝，并不需要什么具体理由。就算表面上有，也很可能只是心已经离开的结果，事后才编造出的借口而已。因为倘若心没有离开，当将会导致关系破裂的事态发生时，理应有人努力去挽救。如果没有，说明其实关系早已破裂。 你的地图是一张白纸，所以即使想决定目的地，也不知道路在哪里。 换个角度，正因为是一张白纸，才可以随心所欲的描绘地图。一切全在你自己。对你来说，一切都是自由的，在你面前是无限的可能。这可是很棒的事啊。 虽然至今为止的道路绝非一片坦途，但想到正因为活着才有机会感受到痛楚，我就成功克服了种种困难。 人与人之间的关系往往不是因为某些具体的原因而断绝。不，即使表面上有某种原因，其实是因为彼此的心已经不在一起，事后才牵强附会地找这些借口。因为，如果彼此的心没有分开，当发生可能会导致彼此关系断绝的事态时，某一方就会主动修复。之所以没有人注重修复，就是因为彼此的心已经不在一起了。就好像眼看着船要沉了，仍然在一旁袖手旁观。 其实很久以前我就知道自己应该怎样选择，只是一直无法下决心舍弃梦想。到现在，我依然不知道怎样才能做到这一点。打个比方，这就如同单相思的感觉，明知恋情不会有结果，却还是忘不了对方。 其实若真正有才华，运气并不是那么重要 无论现在多么的不开心，你要相信，明天会比今天更好。 我的回答之所以发挥了作用，原因不是别的，是因为他们自己很努力。如果自己不想积极认真的生活，不管得到什么样的回答都没用。 他觉得一个人奋斗更轻松自在。跟没有干劲的人在一起厮混，只会徒增压力。 他们都是内心破了个洞，重要的东西正在从破洞中逐渐流失。 请不要一厢情愿的下结论。任何事情，不挑战一下是不知道结果的，对吧？ 当你犹豫要不要去做一件事的时候，其实你内心已经有了选择，只是你还没有充足的理由去说服自己。 读后感前两天和朋友聊天，让他推荐点书看看。然而他就回了四个字“东野圭吾”。不过随后我就去书店，谁知刚进店映入眼帘的就是他的书。《白夜行》、《嫌疑人X的献身》、《名侦探的守则》、《解忧杂货店》等...因为试读本被别人拿走的原因，我只能通过封面上那么简短的几句介绍去了解这些书。大多是推理类的，我现在的心境不太想读这种类型的，过段时间可能会读吧...最终选择了《解忧杂货店》。原因可能因为自己平时也比较烦恼吧。看通过这本书，能不能让自己找到解忧的方法。 故事是从三个犯了错刚成年的孩子，因为偷车暂避到一间很久没有人住的废弃屋也就是“浪矢杂货店”，在熟悉了屋内的基本情况以后，突然掉进卷帘门后瓦楞纸箱的一封信开始的。刚好漫漫长夜，可以通过读信回信来打发时间，随着几封信的往来，他们惊讶的发现这家店连接着过去和现在，而且屋内的时间流逝比外面慢很多。 第一封来信是一个以月兔自称的国家击剑运动员。她在努力训练争取参加奥运会和陪伴身患癌症时日所剩不多的恋人之间不断纠结。第二封是以鱼店音乐人自称的一个喜欢音乐但是始终没有成就的人投进来的。他在父母年事以高要回家继承鱼店和继续追求梦想之间不断纠结。随后是讲述店主浪矢熊治的故事，以及一个女人因为怀了有妇之夫的孩子以后生和不生之间纠结。第三封是一个出生在富裕家庭特别喜欢披头士音乐的孩子，因为家庭意外破产，父母决定潜逃避债，感受到家庭关系疏远想逃离却又无法下决定之间纠结。第四封是年幼父母双亡，后来被好心姨婆收养，白天在普通办公司工作，晚上做陪酒工作。在要不要辞掉工作和当某个男人的情人之间帮助家里摆脱经济困难之间纠结。其实他们之间都是有关联的，关联他们的就是一家叫丸光园的孤儿院。他们都在里面扮演过不同的角色。当然那三个犯错的刚成年的孩子也在里面待过。同时最后一个来信者又是三个孩子刚刚抢劫的人，故事到这也全部贯穿了起来。 总得来说，这是一本讲人和人之间真诚沟通的书。这几个人在通过几封来信和回信之后找到了自己的选择方向，同时也坚定了自己的选择。就像书里说的，其实所有纠结做选择的人心里早就有了答案，咨询只是想得到内心所倾诉的选择。最终的所谓命运，还是自己一步步走出来的。同时还有一种“天生我才必有用”观念，三个不良少年，通过自己的方式，也能给过去的人一些实用的人生建议。其实也有一种，道理我都懂，只是做不做的问题。 在现在这个社会，其实能做到这种真诚的沟通又有几个呢。如果我们也能像书里的人一样，多能站在对方的角度去考虑问题，又怎么会有那么多的烦恼呢。掌握了这个，其实也就能处理各种关系了吧。比如父母子女间的、上司员工间的、亲戚朋友间的... 无论遇到多大的困难，多么糟糕的事，只要你愿意敞开心扉，总会收到一些建议，即便可能这不是自己想要的，但你会明白同时也坚定自己想要的是什么了。 我衷心祈祷每一个人都可以相信自己，无悔的燃烧自己的人生。","categories":[{"name":"阅读","slug":"阅读","permalink":"http://yoursite.com/categories/阅读/"}],"tags":[{"name":"文学","slug":"文学","permalink":"http://yoursite.com/tags/文学/"}],"keywords":[{"name":"阅读","slug":"阅读","permalink":"http://yoursite.com/categories/阅读/"}]},{"title":"前端JS干货","slug":"前端JS干货","date":"2019-06-10T10:53:25.000Z","updated":"2019-06-10T15:15:46.425Z","comments":true,"path":"2019/06/10/前端JS干货/","link":"","permalink":"http://yoursite.com/2019/06/10/前端JS干货/","excerpt":"","text":"未完待更新… js基础知识复习html,css,js是前端的基础,只有基础打牢了,那么再去学习框架等等就简单很多。那么现在就好好的复习一下前端的基础知识 JavaScript是什么？JavaScript 是属于 HTML 和 Web 的编程语言。 JavaScript能做什么？ 可以改变 HTML 内容。 可以改变 HTML 属性。 可以改变 CSS 样式。 可以显示隐藏HTML元素。 可以实现页面的一切逻辑。 JavaScript怎么使用&lt;script&gt; 标签 JavaScript 输出语句1234alert() // 弹窗,不支持直接查看复杂数据document.write() // 写入HTML输出innerHTML() // 写入某个html元素console.log() // 在控制台打印数据 其中console 这个对象有很多方法 具体有哪些点 console对象 下面就列一些常见的 1234console.log(&apos;hello&apos;);console.info(&apos;信息&apos;);console.error(&apos;错误&apos;);console.warn(&apos;警告&apos;);","categories":[{"name":"前端","slug":"前端","permalink":"http://yoursite.com/categories/前端/"}],"tags":[{"name":"js初级","slug":"js初级","permalink":"http://yoursite.com/tags/js初级/"}],"keywords":[{"name":"前端","slug":"前端","permalink":"http://yoursite.com/categories/前端/"}]},{"title":"《摆渡人》","slug":"《摆渡人》","date":"2019-06-10T05:18:46.000Z","updated":"2019-06-10T15:15:42.874Z","comments":true,"path":"2019/06/10/《摆渡人》/","link":"","permalink":"http://yoursite.com/2019/06/10/《摆渡人》/","excerpt":"","text":"内容简介单亲女孩迪伦，15岁的世界一片狼藉：与母亲总是无话可说，在学校里经常受到同学的捉弄，唯一谈得来的好友也因为转学离开了。这一切都让迪兰感到无比痛苦。 她决定去看望久未谋面的父亲，然而，路上突发交通事故。等她拼命爬出火车残骸之后，却惊恐地发现，自己是唯一的幸存者，而 眼前，竟是一片荒原。 此时，迪兰看到不远处的山坡上一个男孩的身影。 男孩将她带离了事故现场。但是，迪兰很快意识到，男孩并不是偶然出现的路人，他似乎是特意在此等候。 命运，从他们相遇的那刻开始，发生了无法预料的转变…… 作者简介克莱儿•麦克福尔居住在苏格兰格拉斯哥南部，是英国文坛备受瞩目的实力作家。 她的作品往往在出其不意的情节架构中饱含感人至深的真情，贯穿着人生思索和人性独白。 《摆渡人》是她最著名的作品，一举摘得五项世界文学大奖，版权销售33个国家，是令千万读者灵魂震颤的心灵治愈小说。 经典语句如果我真的存在，也是因为你需要我。（I exist because you need me.） 如果命运是一条孤独的河流，谁会是你灵魂的摆渡人？ 因为你需要我，因为爱。 你们天人总是一厢情愿，总以为世人应该微笑着，那不是很残酷，没有人愿意。 人活着就会失去。你失去的不会再来，你争取的永远都会失去。 你之所以相信一个人说的话，是因为他说了你想听的话。 有些喜欢，就是麦田里曾降临过的风，只有当事人明了，而这的世界假装没发生。 每个人都有无法放弃的执念，为了这个执念我们背弃了神，潜于幽暗的河底，化身般若，一去不返。 每个人心里都有脆弱的一面，如果放大这种脆弱的话，没人想活。 忘川之畔，与君长相憩，烂泥之中，与君发相缠。 彼岸烟波流转，可有人寻我。对岸繁华三千，可有人渡我。 我们从虚空中来，每个人都抱着善与恶，有人升入天堂，有人堕入地狱，在无边的业火中，我想起你，想起从前，我们曾经离得那么近。 在光明出生以前，大地上充斥着黑暗，人类天生畏惧黑暗，那是光明无法抵达的阴霾之地，在那里涌动着令人恐惧的存在。 诞生于想象之中，流传于口舌之上，欲望，永远存在，生生不息。 单影难存，与君相联，影随身动，举止之间。化无形常随左右，谁又知影心之恋。欲与君相视，却又阴阳两别，只愿随身后，朝陪夜伴。 你有没有过这样的东西，沾染过你的体温，聆听过你的心事，它们得到爱，回报爱。你有没有丢弃过这样的东西，它们在黑暗的角落，想念着你。即使粉身碎骨，即使已过经年，终有一天，思念，会把它们带到你的身边。 我们还活着的时候，幸存者便逝去了，未来降临的时候，我们已经不再属于未来，那渴望已久的冥冥未知，不过是死亡罢了，唯有死亡。 读后感《摆渡人》这是一本关于爱的书。让人充满爱和善良。 书中讲述了15岁的迪伦，在一团糟的氛围下，满怀期盼的去见素未谋面的父亲，然而，火车上出了事故。迪伦也因此死去。但书中讲到死亡其实并不意味着结束，只要跟随自己的摆渡人穿过一片荒原，那么就能到达彼岸，另一个世界所谓永生的“家”。 每个人都要穿过自己的荒原。在这里发现自己死去的事实，然后去接受真相。在行走期间，魔鬼会拼命抓住穿越的灵魂。只有在天黑前到达安全屋，才能免受灾难（被恶鬼吞噬，成为其中的一员)。至于荒原是什么样子，完全由灵魂去决定。心情会影响天气。“你的身体是你心像的投射。这片荒原也是一样的。当你从隧道出来的时候，你估摸着这几离阿伯丁还有一半路――身处高原的某个地方，一个偏僻、多山、荒凉的地方――所以荒原也就成了这个样子。你不喜欢锻炼，所以只要一走路，你的心情就糟透了。这个地方反映了你的所思所感。当你生气的时候，这里就阴云密布，狂风大作……一片漆黑。你的心里越阴郁，夜晚也就越黑暗。” 如果书中的世界维度是真的。谁又能确定我们现在不是身处荒原之中呢。我们从出生，然后学习成长，至于以后会去哪里，自己变成什么样子，谁又能说的清楚呢。成长过程中遇到的各种坎坷、挫折，谁又能确定不是那些恶鬼在作祟呢。一些人夭折，英年早逝，谁又能知道是不是被恶鬼拉入湖里呢。我们每个人对待世界的看法，悲观、乐观，谁又能确定这不是自己的性格造成的呢。我们所爱的人，谁又能知道他们是不是自己的摆渡人呢。 在那个所谓的家的地方，很多人悠然自得地生活在那里。例如，二战期间被上司枪毙的士兵乔纳斯――“我活着的时候总是想买辆车”，于是他在自己的“家乡”斯图加特，开车、修车，“现在我可以买得起自己想要的东西了。尽管我觉得不管我对它做什么它都会跑起来，但我还是喜欢假装这一切跟我有关系。我从荒原穿过来看到它的时候简直太激动了……”在乔纳斯走过荒原的时候，很平淡，十八岁就被枪毙了，他还没来得及体验爱情，于是车是他的最爱。我猜想，乔纳斯在荒原行走的时候，应该很无聊吧。在荒原上的一生，应该是寡淡的。还有，伊莱扎，那个告诉迪伦关于回去的秘密的、“在这里已经很久”的人，她每天坐在一把老式木摇椅上轻轻摇晃着，等待着，“我知道用不了多久丈夫就能来陪伴我了。”可是，谁知道呢，谁知道她的丈夫在穿越荒原时会不会发生意外，谁知道她的丈夫在抵达“家”的时候，会不会选择来见她。她“在这里已经很久了”，也许，上面所说的那些“谁知道”已经发生了。然而，她就是那么等待着，从来没有想过要回去找自己的爱人。因为，她怕，她问迪伦的话，就证明了一切――“你宁愿让自己的灵魂灰飞烟灭都要回去?” 所以，不是这个地方不让他们走，而是这些灵魂自己束缚了自己。 迪伦勇敢的迈出了这一步，因为爱，因为了坚定不移的爱。同时也是因为她的勇敢。那么故事最后，迪伦成功的和自己的摆渡人崔斯坦，永久的活在了那个“家”。因为她的勇敢，她的爱，她的善良，以及发现了可以拯救变成恶鬼的灵魂，终归还是影响到了很多人。 “伊莱扎握住圆形把手，然后深吸一口气，扭动了把手......她真的认为自己要在这里站上几个钟头，寻找勇气和信念，直到她完全确信自己真的想这么做。 但她只是轻轻一拧，门就开了”","categories":[{"name":"阅读","slug":"阅读","permalink":"http://yoursite.com/categories/阅读/"}],"tags":[{"name":"文学","slug":"文学","permalink":"http://yoursite.com/tags/文学/"}],"keywords":[{"name":"阅读","slug":"阅读","permalink":"http://yoursite.com/categories/阅读/"}]},{"title":"使用hexo写博客--简易步骤","slug":"使用hexo写博客-简易步骤","date":"2019-06-09T07:24:33.000Z","updated":"2019-06-09T11:05:54.292Z","comments":true,"path":"2019/06/09/使用hexo写博客-简易步骤/","link":"","permalink":"http://yoursite.com/2019/06/09/使用hexo写博客-简易步骤/","excerpt":"","text":"第一步 创建文章在文件根目录运行Bash 1$ hexo new &quot;文章名&quot; 第二步 编辑文章进入到 source/_posts 找到对应的文件,用编辑器去编写文章。mackdown语法在我的另一篇博客中有写到。 如果要预览可以执行下面代码 1hexo s 然后在浏览器输入 http://localhost:4000 第三步 生成html1$ hexo g 第四步 上传服务器1234$ cd public$ git add -A$ git commit -a -m &apos;编辑信息&apos;$ git push &quot;远程服务器地址&quot;","categories":[{"name":"工具","slug":"工具","permalink":"http://yoursite.com/categories/工具/"}],"tags":[{"name":"工具","slug":"工具","permalink":"http://yoursite.com/tags/工具/"}],"keywords":[{"name":"工具","slug":"工具","permalink":"http://yoursite.com/categories/工具/"}]},{"title":"计算机基础知识---机器组成","slug":"计算机基础知识-机器组成","date":"2019-06-09T05:35:59.000Z","updated":"2019-06-09T06:34:14.035Z","comments":true,"path":"2019/06/09/计算机基础知识-机器组成/","link":"","permalink":"http://yoursite.com/2019/06/09/计算机基础知识-机器组成/","excerpt":"","text":"计算机是由硬件系统（hardware system）和软件系统（software system）两部分组成的。 传统电脑系统的硬体单元一般可分为输入单元、输出单元、算术逻辑单元、控制单元及记忆单元，其中算术逻辑单元和控制单元合称中央处理单元（Center Processing Unit,CPU)。 硬件系统 电源 电源是电脑中不可缺少的供电设备，它的作用是将220V交流电转换为电脑中使用的5V、12V、3.3V直流电，其性能的好坏，直接影响到其他设备工作的稳定性，进而会影响整机的稳定性。手提电脑在自带锂电池情况下，为手提电脑提供有效电源。 主板 主板是电脑中各个部件工作的一个平台，它把电脑的各个部件紧密连接在一起，各个部件通过主板进行数据传输。也就是说，电脑中重要的“交通枢纽”都在主板上，它工作的稳定性影响着整机工作的稳定性。 CPU CPU即中央处理器，是一台计算机的运算核心和控制核心。其功能主要是解释计算机指令以及处理计算机软件中的数据。CPU由运算器、控制器、寄存器、高速缓存及实现它们之间联系的数据、控制及状态的总线构成。作为整个系统的核心，CPU也是整个系统最高的执行单元，因此CPU已成为决定电脑性能的核心部件，很多用户都以它为标准来判断电脑的档次。 内存 内存又叫内部存储器或者是随机存储器（RAM），分为DDR内存和SDRAM内存，（但是SDRAM由于容量低，存储速度慢，稳定性差，已经被DDR淘汰了）内存属于电子式存储设备，它由电路板和芯片组成，特点是体积小，速度快，有电可存，无电清空，即电脑在开机状态时内存中可存储数据，关机后将自动清空其中的所有数据。 内存有DDR、DDR II、DDR III三大类，容量1-64GB。 硬盘 硬盘属于外部存储器，机械硬盘由金属磁片制成，而磁片有记忆功能，所以储到磁片上的数据，不论在开机，还是关机，都不会丢失。硬盘容量很大，已达TB级，尺寸有3.5、2.5、1.8、1.0英寸等，接口有IDE、SATA、SCSI等，SATA最普遍。移动硬盘是以硬盘为存储介质，强调便携性的存储产品。市场上绝大多数的移动硬盘都是以标准硬盘为基础的，而只有很少部分的是以微型硬盘（1.8英寸硬盘等）为基础，但价格因素决定着主流移动硬盘还是以标准笔记本硬盘为基础。因为采用硬盘为存储介质，因此移动硬盘在数据的读写模式与标准IDE硬盘是相同的。移动硬盘多采用USB、IEEE1394等传输速度较快的接口，可以较高的速度与系统进行数据传输。固态硬盘用固态电子存储芯片阵列而制成的硬盘，由控制单元和存储单元（FLASH芯片）组成。固态硬盘在产品外形和尺寸上也完全与普通硬盘一致但是固态硬盘比机械硬盘速度更快。 声卡 声卡是组成多媒体电脑必不可少的一个硬件设备，其作用是当发出播放命令后，声卡将电脑中的声音数字信号转换成模拟信号送到音箱上发出声音。 显卡 显卡在工作时与显示器配合输出图形、文字，作用是将计算机系统所需要的显示信息进行转换驱动，并向显示器提供行扫描信号，控制显示器的正确显示，是连接显示器和个人电脑主板的重要元件，是“人机对话”的重要设备之一。 网卡 网卡是工作在数据链路层的网路组件，是局域网中连接计算机和传输介质的接口，不仅能实现与局域网传输介质之间的物理连接和电信号匹配，还涉及帧的发送与接收、帧的封装与拆封、介质访问控制、数据的编码与解码以及数据缓存的功能等。网卡的作用是充当电脑与网线之间的桥梁，它是用来建立局域网并连接到Internet的重要设备之一。 在整合型主板中常把声卡、显卡、网卡部分或全部集成在主板上。 调制解调器 英文名为“Modem”，俗称“猫”，即调制解调器，类型有内置式和外置式，有线式和无线式。调制解调器是通过电话线上网时必不可少的设备之一。它的作用是将电脑上处理的数字信号转换成电话线传输的模拟信号。随着ADSL宽带网的普及，内置式调制解调器逐渐退出了市场。 光驱 英文名为“Optical Disk driver”，电脑用来读写光碟内容的机器，也是在台式机和笔记本便携式电脑里比较常见的一个部件。随着多媒体的应用越来越广泛，使得光驱在计算机诸多配件中已经成为标准配置。光驱可分为CD-ROM驱动器、DVD光驱（DVD-ROM）、康宝（COMBO）和DVD刻录机（DVD-RAM）等。读写的能力和速度也日益提升，4× 16× 32× 40× 48×。 显示器 键盘 鼠标 音箱 打印机 视频设备 闪存盘 ===&gt; U盘 移动存储卡及读卡器 软件系统所谓软件是指为方便使用计算机和提高使用效率而组织的程序以及用于开发、使用和维护的有关文档。软件系统可分为系统软件和应用软件两大类。 系统软件系统软件System software,由一组控制计算机系统并管理其资源的程序组成，其主要功能包括：启动计算机，存储、加载和执行应用程序，对文件进行排序、检索，将程序语言翻译成机器语言等。实际上，系统软件可以看作用户与计算机的接口，它为应用软件和用户提供了控制、访问硬件的手段，这些功能主要由操作系统完成。此外，编译系统和各种工具软件也属此类，它们从另一方面辅助用户使用计算机。下面分别介绍它们的功能。 操作系统（Operating System，OS） 操作系统是管理、控制和监督计算机软、硬件资源协调运行的程序系统，由一系列具有不同控制和管理功能的程序组成，它是直接运行在计算机硬件上的、最基本的系统软件，是系统软件的核心。操作系统是计算机发展中的产物，它的主要目的有两个：一是方便用户使用计算机，是用户和计算机的接口。比如用户键入一条简单的命令就能自动完成复杂的功能，这就是操作系统帮助的结果；二是统一管理计算机系统的全部资源，合理组织计算机工作流程，以便充分、合理地发挥计算机的效率。操作系统通常应包括下列五大功能模块： （1）处理器管理：当多个程序同时运行时，解决处理器（CPU）时间的分配问题。 （2）作业管理：完成某个独立任务的程序及其所需的数据组成一个作业。作业管理的任务主要是为用户提供一个使用计算机的界面使其方便地运行自己的作业，并对所有进入系统的作业进行调度和控制，尽可能高效地利用整个系统的资源。 （3）存储器管理：为各个程序及其使用的数据分配存储空间，并保证它们互不干扰。 （4）设备管理：根据用户提出使用设备的请求进行设备分配，同时还能随时接收设备的请求（称为中断），如要求输入信息。 （5）文件管理：主要负责文件的存储、检索、共享和保护，为用户提供文件操作的方便。 操作系统的种类繁多，依其功能和特性分为分批处理操作系统、分时操作系统和实时操作系统等；依同时管理用户数的多少分为单用户操作系统和多用户操作系统；适合管理计算机网络环境的网络操作系统。 微机操作系统随着微机硬件技术的发展而发展，从简单到复杂。Microsoft公司开发的DOS是一单用户单任务系统，而Windows操作系统则是一多户多任务系统，经过十几年的发展，已从Windows 3.1发展Windows NT、Windows 2000、Windows XP、Windows vista、Windows 7和Windows 8等等。它是当前微机中广泛使用的操作系统之一。Linux是一个源码公开的操作系统，程序员可以根据自己的兴趣和灵感对其进行改变，这让Linux吸收了无数程序员的精华，不断壮大，已被越来越多的用户所采用，是Windows操作系统强有力的竞争对手。 语言处理系统（翻译程序） 人和计算机交流信息使用的语言称为计算机语言或称程序设计语言。计算机语言通常分为机器语言、汇编语言和高级语言三类。如果要在计算机上运行高级语言程序就必须配备程序语言翻译程序（下简称翻译程序）。翻译程序本身是一组程序，不同的高级语言都有相应的翻译程序。翻译的方法有两种： 一种称为“解释”。早期的BASIC源程序的执行都采用这种方式。它调用机器配备的BASIC“解释程序”，在运行BASIC源程序时，逐条把BASIC的源程序语句进行解释和执行，它不保留目标程序代码，即不产生可执行文件。这种方式速度较慢，每次运行都要经过“解释”，边解释边执行。 另一种称为“编译”，它调用相应语言的编译程序，把源程序变成目标程序（以.OBJ为扩展名），然后再用连接程序，把目标程序与库文件相连接形成可执行文件。尽管编译的过程复杂一些，但它形成的可执行文件（以.exe为扩展名）可以反复执行，速度较快。运行程序时只要键入可执行程序的文件名，再按Enter键即可。 对源程序进行解释和编译任务的程序，分别叫作编译程序和解释程序。如FORTRAN、COBOL、PASCAL和C等高级语言，使用时需有相应的编译程序；BASIC、LISP等高级语言，使用时需用相应的解释程序。 服务程序 服务程序能够提供一些常用的服务性功能，它们为用户开发程序和使用计算机提供了方便，像微机上经常使用的诊断程序、调试程序、编辑程序均属此类。 数据库管理系统 数据库是指按照一定联系存储的数据集合，可为多种应用共享。数据库管理系统（Data Base Management System，DBMS）则是能够对数据库进行加工、管理的系统软件。其主要功能是建立、消除、维护数据库及对库中数据进行各种操作。数据库系统主要由数据库（DB）、数据库管理系统（DBMS）以及相应的应用程序组成。数据库系统不但能够存放大量的数据，更重要的是能迅速、自动地对数据进行检索、修改、统计、排序、合并等操作，以得到所需的信息。这一点是传统的文件柜无法作到的。 数据库技术是计算机技术中发展最快、应用最广的一个分支。可以说，在今后的计算机应用开发中大都离不开数据库。因此，了解数据库技术犹其是微机环境下的数据库应用是非常必要的。 应用软件为解决各类实际问题而设计的程序系统称为应用软件。从其服务对象的角度，又可分为通用软件和专用软件两类。","categories":[{"name":"计算机知识","slug":"计算机知识","permalink":"http://yoursite.com/categories/计算机知识/"}],"tags":[{"name":"计算机知识","slug":"计算机知识","permalink":"http://yoursite.com/tags/计算机知识/"},{"name":"机器组成","slug":"机器组成","permalink":"http://yoursite.com/tags/机器组成/"}],"keywords":[{"name":"计算机知识","slug":"计算机知识","permalink":"http://yoursite.com/categories/计算机知识/"}]},{"title":"计算机基础知识--发展史","slug":"计算机基础知识-发展史","date":"2019-06-09T05:19:19.000Z","updated":"2019-06-09T05:34:52.321Z","comments":true,"path":"2019/06/09/计算机基础知识-发展史/","link":"","permalink":"http://yoursite.com/2019/06/09/计算机基础知识-发展史/","excerpt":"","text":"计算工具的演化经历了由简单到复杂、从低级到高级的不同阶段，例如从“结绳记事”中的绳结到算筹、算盘计算尺、机械计算机等。它们在不同的历史时期发挥了各自的历史作用，同时也启发了现代电子计算机的研制思想。 标题 内容 中文名 计算机 外文名 computer 时 间 1946年 第一台计算机 ENIAC 别 称 电脑 发明者 约翰·冯·诺依曼 1889年，美国科学家赫尔曼·何乐礼研制出以电力为基础的电动制表机，用以储存计算资料。 1930年，美国科学家范内瓦·布什造出世界上首台模拟电子计算机。 1946年2月14日，由美国军方定制的世界上第一台电子计算机“电子数字积分计算机”（ENIAC Electronic Numerical And Calculator）在美国宾夕法尼亚大学问世了。ENIAC（中文名：埃尼阿克）是美国奥伯丁武器试验场为了满足计算弹道需要而研制成的，这台计算器使用了17840支电子管，大小为80英尺×8英尺，重达28t（吨），功耗为170kW，其运算速度为每秒5000次的加法运算，造价约为487000美元。ENIAC的问世具有划时代的意义，表明电子计算机时代的到来。在以后60多年里，计算机技术以惊人的速度发展，没有任何一门技术的性能价格比能在30年内增长6个数量级。 第1代：电子管数字机（1946—1958年） 硬件方面，逻辑元件采用的是真空电子管，主存储器采用汞延迟线阴极射线示波管静电存储器、磁鼓、磁芯；外存储器采用的是磁带。软件方面采用的是机器语言、汇编语言。应用领域以军事和科学计算为主。 特点是体积大、功耗高、可靠性差。速度慢（一般为每秒数千次至数万次）、价格昂贵，但为以后的计算机发展奠定了基础。 第2代：晶体管数字机（1958—1964年） 硬件方面的操作系统、高级语言及其编译程序应用领域以科学计算和事务处理为主，并开始进入工业控制领域。特点是体积缩小、能耗降低、可靠性提高、运算速度提高（一般为每秒数10万次，可高达300万次）、性能比第1代计算机有很大的提高 第3代：集成电路数字机（1964—1970年） 硬件方面，逻辑元件采用中、小规模集成电路（MSI、SSI），主存储器仍采用磁芯。软件方面出现了分时操作系统以及结构化、规模化程序设计方法。特点是速度更快（一般为每秒数百万次至数千万次），而且可靠性有了显著提高，价格进一步下降，产品走向了通用化、系列化和标准化等。应用领域开始进入文字处理和图形图像处理领域。 第4代：大规模集成电路机（1970年至今） 硬件方面，逻辑元件采用大规模和超大规模集成电路（LSI和VLSI）。软件方面出现了数据库管理系统、网络管理系统和面向对象语言等。1971年世界上第一台微处理器在美国硅谷诞生，开创了微型计算机的新时代。应用领域从科学计算、事务管理、过程控制逐步走向家庭。","categories":[{"name":"计算机知识","slug":"计算机知识","permalink":"http://yoursite.com/categories/计算机知识/"}],"tags":[{"name":"发展史","slug":"发展史","permalink":"http://yoursite.com/tags/发展史/"},{"name":"计算机知识","slug":"计算机知识","permalink":"http://yoursite.com/tags/计算机知识/"}],"keywords":[{"name":"计算机知识","slug":"计算机知识","permalink":"http://yoursite.com/categories/计算机知识/"}]},{"title":"Markdown基本语法","slug":"Markdown基本语法","date":"2019-06-08T16:04:22.000Z","updated":"2019-06-09T10:21:45.352Z","comments":true,"path":"2019/06/09/Markdown基本语法/","link":"","permalink":"http://yoursite.com/2019/06/09/Markdown基本语法/","excerpt":"","text":"基础语法标题Markdown支持6种级别的标题，对应html标签 h1 ~ h6 123456# h1## h2### h3#### h4##### h5###### h6 以上标记效果如下 h1h2h3h4h5h6除此之外，Markdown还支持另外一种形式的标题展示形式，其类似于 Setext 标记语言的表现形式，使用下划线进行文本大小的控制 1234这是一级标题===这是二级标题--- 使用这种方式处理标题仅有两种表现形式，即一级标题和二级标题。 这是一级标题这是二级标题这种处理方式在Github的一些开源工程上面比较常见，显而易见的缺点是：文字大小控制级别有限。 段落及区块引用需要记住的是，Markdown其实就是一种易于编写的普通文本，只不过加入了部分渲染文本的标签而已。其最终依然会转换为html标签，因此使用Markdown分段非常简单，前后至少保留一个空行即可。 而另外一个比较常见的需求就是，我们可能希望对某段文字进行强调处理。Markdown提供了一个特殊符号&gt;用于段首进行强调，被强调的文字部分将会高亮显示 1&gt; 这段文字将被高亮显示... 以上标记显示效果如下： 这段文字将被高亮显示… 插入链接或图片*Markdown针对链接和图片的处理也比较简单，可以使用下面的语法进行标记 12[点击跳转至我的博客](https://github.com/RDHuang)![图片](路径) 以上标记显示效果如下： 点击跳转至我的博客 注： 引用图片和链接的唯一区别就是在最前方添加一个感叹号。 列表 Markdown支持有序列表和无序列表两种形式： 无序列表使用*或+或-标识 有序列表使用数字加.标识，例如：1. 123456789101112131415* 张三* 李四* 王五+ 张三+ 李四+ 王五- 张三- 李四- 王五1. 张三2. 李四3. 王五 以上标记显示效果如下： 张三 李四 王五 张三 李四 王五 张三 李四 王五 张三 李四 王五 注：这里比较有趣的地方是，对于有序列表，Markdown将只关注你的第一个项目的数字编号。例如：如果第一个项目编号是3，以此类推，第二个项目应该是4，最终将显示为3、4、5。而如果你指定了第一个编号，后面的编号指定错误也没有关系，Markdown将只在乎你的第一个项目编号。 使用列表的一些注意事项如果在单一列表项中包含了多个段落，为了保证渲染正常，*与段落首字母之间必须保留四个空格 123456* 段落一 小段一* 段落二 小段二 以上标记显示效果如下： 段落一 小段一 段落二 小段二 另外，如果在列表中加入了区块引用，区域引用标记符也需要缩进4个空格 1234* 段落一 &gt; 区块标记一* 段落二 &gt; 区块标记二 以上标记显示效果如下： 段落一 区块标记一 段落二 区块标记二 注：记住一个原则，如果在和列表配合使用的时候出现了问题，就缩进一次，四个空格或者一个制表符代表一次缩进。如果一次缩进没有解决问题，那就两次。 分割线有时候，为了排版漂亮，可能会加入分隔线。Markdown加入分隔线非常简单，使用下面任意一种形式都可以 12345一行文字***一行文字---一行文字 以上标记显示效果如下： 一行文字 一行文字一行文字 产生分隔线的语法要求比较松，符号之间添加空格也可以 强调有时候，我们希望对某一部分文字进行强调，使用*或_包裹即可。使用单一符号标记的效果是斜体，使用两个符号标记的效果是加粗 12345*这里是斜体*_这里是斜体_**这里是加粗**__这里是加粗__ 以上标记显示效果如下： 这里是斜体这里是斜体 这里是加粗这里是加粗 插入代码块1代码上下用三个反引号 ``` 给包裹起来就行了 注：很多人不知道怎么输入反引号。在英文模式下，找到键盘最左侧esc键下面的第一个键点击即可。 插入表格表格是Markdown语法中比较复杂的一个，其语法如下： 123表头|条目一|条目二:---:|:---:|:---:项目|项目一|项目二 以上标记显示效果如下： 表头 条目一 条目二 项目 项目一 项目二 注：三个短斜杠左右的冒号用于控制对齐方式，只放置左边冒号表示文字居左，只放置右边冒号表示文字居右，如果两边都放置冒号表示文字居中。 特殊符号处理Markdown使用反斜杠\\插入语法中用到的特殊符号。在Markdown中，主要有以下几种特殊符号需要处理： 123456789101112\\ 反斜线` 反引号* 星号_ 底线&#123;&#125; 花括号[] 方括号() 括弧# 井字号+ 加号- 减号. 英文句点! 惊叹号 例如，如果你需要插入反斜杠，就连续输入两个反斜杠即可：\\\\ =&gt; \\ 。 注：在内容中输入以上特殊符号的时候一定要注意转义，否则将导致内容显示不全，甚至排版混乱。 附: 参考 简书 欧阳峰 附上链接 最完整的Markdown基础教程","categories":[{"name":"工具","slug":"工具","permalink":"http://yoursite.com/categories/工具/"}],"tags":[{"name":"编辑器","slug":"编辑器","permalink":"http://yoursite.com/tags/编辑器/"},{"name":"Markdown","slug":"Markdown","permalink":"http://yoursite.com/tags/Markdown/"}],"keywords":[{"name":"工具","slug":"工具","permalink":"http://yoursite.com/categories/工具/"}]},{"title":"个人博客使用hexo搭建","slug":"个人博客使用hexo搭建","date":"2019-06-08T14:38:58.000Z","updated":"2019-06-09T05:16:01.423Z","comments":true,"path":"2019/06/08/个人博客使用hexo搭建/","link":"","permalink":"http://yoursite.com/2019/06/08/个人博客使用hexo搭建/","excerpt":"","text":"使用hexo搭建博客安装安装 Hexo 相当简单。然而在安装前，您必须检查电脑中是否已安装下列应用程序： Node.js(至少是6.9版本以上) git 如果已经安装上诉必备程序,那么接下来就可以直接使用npm安装hexo 1$ npm install -g hexo-cli 建站安装hexo以后,执行下面代码,初始化一个项目 123$ hexo init &lt;folder&gt;$ cd &lt;folder&gt;$ npm install 新建完成后,指定文件夹的目录如下 12345678.├── _config.yml // 网站的配置信息├── package.json // 应用程勋的信息├── scaffolds // 模板文件夹├── source // 资源文件夹| ├── _drafts| └── _posts└── themes // 主题文件夹 配置您可以在 _config.yml 中修改大部分的配置。 网站 参数 描述 title 网站标题 subtitle 网站副标题 description 网站描述 author 您的名字 language 网站使用的语言 timezone 网站时区。Hexo 默认使用您电脑的时区。时区列表。比如说：America/New_York, Japan, 和 UTC 。 其中，description主要用于SEO，告诉搜索引擎一个关于您站点的简单描述，通常建议在其中包含您网站的关键词。author参数用于主题显示文章的作者。 网址 参数 描述 默认值 url 网址 root 网站根目录 permalink 文章的永久链接格式 :year/:month/:day/:title/ permalink_defaults 永久链接中各部分的默认值 网站存放在子目录 如果您的网站存放在子目录中，例如 http://yoursite.com/blog，则请将您的 url 设为 http://yoursite.com/blog 并把 root 设为 /blog/。 目录 参数 描述 默认值 source_dir 资源文件夹，这个文件夹用来存放内容。 source public_dir 公共文件夹，这个文件夹用于存放生成的站点文件。 public tag_dir 标签文件夹 tags archive_dir 归档文件夹 archives category_dir 分类文件夹 categories code_dir Include code 文件夹 downloads/code i18n_dir 国际化（i18n）文件夹 :lang skip_render 跳过指定文件的渲染，您可使用 glob 表达式来匹配路径。 提示 如果您刚刚开始接触Hexo，通常没有必要修改这一部分的值。 文章 参数 描述 默认值 new_post_name 新文章的文件名称 :title.md default_layout 预设布局 post auto_spacing 在中文和英文之间加入空格 false titlecase 把标题转换为 title case false external_link 在新标签中打开链接 true filename_case 把文件名称转换为 (1) 小写或 (2) 大写 0 render_drafts 显示草稿 false post_asset_folder 启动 Asset 文件夹 false relative_link 把链接改为与根目录的相对位址 false future 显示未来的文章 true highlight 代码块的设置 相对地址 默认情况下，Hexo生成的超链接都是绝对地址。例如，如果您的网站域名为example.com,您有一篇文章名为hello，那么绝对链接可能像这样：http://example.com/hello.html，它是绝对于域名的。相对链接像这样：/hello.html，也就是说，无论用什么域名访问该站点，都没有关系，这在进行反向代理时可能用到。通常情况下，建议使用绝对地址。 分类 &amp; 标签 参数 描述 默认值 default_category 默认分类 uncategorized category_map 分类别名 tag_map 标签别名 日期 / 时间格式Hexo 使用 Moment.js 来解析和显示时间。 参数 描述 默认值 date_format 日期格式 YYYY-MM-DD time_format 时间格式 H:mm:ss 分页 参数 描述 默认值 per_page 每页显示的文章量 (0 = 关闭分页功能) 10 pagination_dir 分页目录 page 扩展 参数 描述 theme 当前主题名称。值为false时禁用主题 deploy 部署部分的设置 指令init1$ hexo init &lt;folder&gt; 新建一个网站. 如果没有设置folder,hexo默认在当前文件夹建立网站 new1$ hexo new [layout] &lt;title&gt; 新建一篇文章. 如果没有设置 layout 的话，默认使用 _config.yml 中的 default_layout 参数代替。如果标题包含空格的话，请使用引号括起来。 1$ hexo new &quot;包含 空格 的 一个 标题&quot; generate1$ hexo generate =简=化=写=法=&gt; hexo g 生成静态文件 选项 描述 -d, –deploy 文件生成后立即部署网站 -w, –watch 监视文件变动 publish1$ hexo publish [layout] &lt;filename&gt; 发表草稿。 server1$ hexo server =简=化=写=法=&gt; hexo s 启动服务器。默认情况下，访问网址为： http://localhost:4000/ 选项 描述 -p, –port 重设端口 -s, –static 只使用静态文件 -l, –log 启动日记记录，使用覆盖记录格式 deploy1$ hexo deplop =简=化=写=法=&gt; hexo d 部署网站参数|描述:—|:—-g,–generate|部署之前预先生成静态文件 render1$ hexo render &lt;file1&gt; [file2] ... 渲染文件 参数 描述 -o, –output 设置输出路径 clean1$ hexo clean 清除缓存文件 (db.json) 和已生成的静态文件 (public)。 在某些情况（尤其是更换主题后），如果发现您对站点的更改无论如何也不生效，您可能需要运行该命令 list1$ hexo list &lt;type&gt; 列出网站资料 version1$ hexo version 显示 Hexo 版本。 安全模式1$ hexo --safe 在安全模式下，不会载入插件和脚本。当您在安装新插件遭遇问题时，可以尝试以安全模式重新执行。 调试模式1$ hexo --debug 在终端中显示调试信息并记录到 debug.log。当您碰到问题时，可以尝试用调试模式重新执行一次，并提交调试信息到 GitHub。 简洁模式1$ hexo --silent 隐藏终端信息 自定义配置文件的路径1$ hexo --config custom.yml 自定义配置文件的路径，执行后将不再使用 _config.yml。 显示草稿1$ hexo --draft 显示 source/_drafts 文件夹中的草稿文章。 自定义 CWD1$ hexo --cwd /path/to/cwd 自定义当前工作目录（Current working directory）的路径。 主题配置 有些配置是需要根据自己选择的主题去配置的。如评论/阅读量/访问量等等","categories":[{"name":"工具","slug":"工具","permalink":"http://yoursite.com/categories/工具/"}],"tags":[{"name":"项目搭建","slug":"项目搭建","permalink":"http://yoursite.com/tags/项目搭建/"},{"name":"hexo","slug":"hexo","permalink":"http://yoursite.com/tags/hexo/"}],"keywords":[{"name":"工具","slug":"工具","permalink":"http://yoursite.com/categories/工具/"}]}]}